#pragma once

#include "windowsTypes.h"
#include "CGlobalVars.h"
#include "CSignature.h"
#include "Log.h"
#include "VMTHooks.h"
#include "Vector.h"
#include "WeaponList.h"
#include "dt_recv2.h"
#include "getvfunc.h"
#include <math.h>
#include <pthread.h>
#include <stdarg.h>
#include <stdlib.h>
#include <thread>
#include <wchar.h>
#include "CNetVars.h"
//#include "ConVar.h"
#include "SDK/studiohdr.h"
using namespace std;

typedef void *(*CreateInterface_t)(const char *, int *);
typedef void *(*CreateInterfaceFn)(const char *pName, int *pReturnCode);

using namespace toolkit;
class CNetVars;
typedef float matrix3x4[3][4];
class CGameTrace;
typedef CGameTrace trace_t;
class CBaseCombatWeapon;
#define me gInts.Engine->GetLocalPlayer()
#define GetBaseEntity gInts.EntList->GetClientEntity
#define MASK_AIMBOT 0x200400B
#define FL_ONGROUND (1 << 0)
#define FL_DUCKING (1 << 1)
#define CONTENTS_HITBOX 0x40000000
#define FLOW_OUTGOING 0
#define FLOW_INCOMING 1
#define PI 3.14159265358979323846f
#define DEG2RAD(x) ((float)(x) * (float)((float)(PI) / 180.0f))
#define RAD2DEG(x) ((float)(x) * (float)(180.0f / (float)(PI)))
#define square(x) (x * x)
#define RADPI 57.295779513082f
#define SQUARE(a) a *a
#define BLU_TEAM 3
#define RED_TEAM 2
struct old_movement_t {
	Vector angle;
	float fwd;
	float sdm;
};
typedef struct player_info_s
{
	char name[32];
	int userID;
	char guid[33];
	unsigned long friendsID;
	char friendsName[32];
	bool fakeplayer;
	bool ishltv;
	unsigned long customFiles[4];
	unsigned char filesDownloaded;
} player_info_t;

class ClientClass
{
private:
	uint8_t _chPadding[8];

public:
	char *chName;
	RecvTable *Table;
	ClientClass *pNextClass;
	int iClassID;
};

class CHLClient
{
public:
	ClientClass *GetAllClasses(void)
	{
		typedef ClientClass *(*OriginalFn)(void *);
		return getvfunc<OriginalFn>(this, 8)(this); //Return the pointer to the head CClientClass.
	}
};

class CGlobals
{
public:
	float realtime;
	int framecount;
	float absoluteframetime;
	float curtime;
	float frametime;
	int maxclients;
	int tickcount;
	float interval_per_tick;
	float interpolation_amount;
};

class CUserCmd
{
public:
	virtual ~CUserCmd(){}; //Destructor 0
	int command_number;	//4
	int tick_count;		   //8
	Vector viewangles;	 //C
	float forwardmove;	 //18
	float sidemove;		   //1C
	float upmove;		   //20
	int buttons;		   //24
	uint8_t impulse;	   //28
	int weaponselect;	  //2C
	int weaponsubtype;	 //30
	int random_seed;	   //34
	short mousedx;		   //38
	short mousedy;		   //3A
	bool hasbeenpredicted; //3C;
};

enum tf_classes
{
	TF2_Scout	= 1,
	TF2_Soldier  = 3,
	TF2_Pyro	 = 7,
	TF2_Demoman  = 4,
	TF2_Heavy	= 6,
	TF2_Engineer = 9,
	TF2_Medic	= 5,
	TF2_Sniper   = 2,
	TF2_Spy		 = 8,
};



class CBaseEntity
{
public: 

	Vector &GetAbsOrigin()
	{
    	typedef Vector &(*OriginalFn)(void *);
    	return getvfunc<OriginalFn>(this, 11)(this);
	}
	bool IsDormant()
	{
		void* pNetworkable = (void*)(this + 0x8);
		typedef bool(*OriginalFn)(void*);
		return getvfunc<OriginalFn>(pNetworkable, 8)(pNetworkable);
	}
	Vector &GetAbsAngles()
	{
    	typedef Vector &(*OriginalFn)(void *);
    	return getvfunc<OriginalFn>(this, 12)(this);
	}
	Vector &GetShootPos() // DONT ASK, I DONT KNOW IF THIS WILL WORK! (Pasted from 8dcc's tf2 cheat)
	{
    	typedef Vector &(*OriginalFn)(void *);
    	return getvfunc<OriginalFn>(this, 302)(this);
	}
	void GetWorldSpaceCenter(Vector &vWorldSpaceCenter)
	{
    	Vector vMin, vMax;
